/*
데시는 D일 동안 다이어트를 하기로 결심했다.
다이어트 전 데시의 체중은 W0 g, 일일 에너지 섭취량 I0 Kcal, 일일 기초 대사량은 일일 에너지 섭취량과 같은 I0 Kcal이다. 데시는 운동을 하지 않아 일일 활동 대사량 A0은 0 Kcal이다.
다이어트 기간, 데시는 일일 에너지 섭취량과 일일 활동 대사량을 바꿀 것이다(물론 다이어트 전과 같을 수도 있다). 데시의 다이어트 기간 일일 에너지 섭취량은 I Kcal, 다이어트 기간 일일 활동 대사량은 A Kcal이다.
다이어트를 하는 동안 데시의 체중과 일일 기초 대사량은 변화한다. 단, 데시의 신체 구조는 매우 단순하여 체중과 일일 기초 대사량은 각각 하루에 단 한 번만 변화한다.
체중은 (일일 에너지 섭취량 − 일일 에너지 소비량) g/Kcal만큼 더해진다고 가정한다. 일일 에너지 소비량은 일일 기초 대사량과 일일 활동 대사량을 더한 값이다.
(일일 에너지 섭취량 − 일일 에너지 소비량) 의 절댓값이 기초 대사량 변화 역치 T Kcal 초과라면, 일일 기초 대사량은 ⌊ (일일 에너지 섭취량 − 일일 에너지 소비량) / 2 ⌋ 만큼 더해진다. 일일 기초 대사량 변화는 같은 날의 체중 변화 다음에 일어난다.

단, 아래에 해당하면 데시는 사망한다.
체중이 0 g 이하인 경우
일일 기초 대사량이 0 Kcal 이하인 경우
D일 간의 다이어트가 끝난 후, 일일 기초 대사량의 변화를 고려하지 않았을 때와 일일 기초 대사량의 변화를 고려했을 때 각각의 예상 체중과 일일 기초 대사량을, 그리고 다이어트 전 데시의 원래 생활로 돌아간다면 몸무게가 증가하는 요요 현상이 일어날지 계산해주자.

첫 번째 줄에는 데시의 다이어트 전 체중 W0 (1 ≤ W0 ≤ 107), 다이어트 전 일일 에너지 섭취량 및 일일 기초 대사량 I0 (1≤ I0 ≤ 105), 기초 대사량 변화 역치 T (1 ≤ T ≤ 1,000)가 빈칸을 사이에 두고 주어진다.
두 번째 줄에는 데시의 다이어트 기간 D (1 ≤ D ≤ 1,000), 다이어트 기간 일일 에너지 섭취량 I (0 ≤ I ≤ 105), 다이어트 기간 일일 활동 대사량 A (0 ≤ A ≤ 105)가 빈칸을 사이에 두고 주어진다.
입력으로 주어지는 모든 수는 정수이며, 단위는 지문에서 언급한 단위를 따른다. 다이어트 동안 체중이 오히려 증가하는 경우는 입력으로 주어지지 않는다.

첫 번째 줄에는 일일 기초 대사량의 변화를 고려하지 않았을 때의 다이어트 후 예상 체중과 일일 기초 대사량을 출력한다. 일일 기초 대사량 변화를 고려하지 않았으므로 다이어트 전 일일 기초 대사량을 그대로 출력하면 된다. 만약 다이어트 도중 데시의 사망이 예상되는 경우 체중과 일일 기초 대사량 대신 Danger Diet를 출력한다.
두 번째 줄에는 일일 기초 대사량의 변화를 고려했을 때의 다이어트 후 예상 체중과 일일 기초 대사량을 출력하고, 변화한 일일 기초 대사량을 가지고 다이어트 전 일일 에너지 섭취량과 다이어트 전 일일 활동 대사량으로 돌아갔을 때 체중이 증가하는 요요 현상이 발생하는 경우 YOYO, 발생하지 않는 경우 NO를 출력한다. 만약 다이어트 도중 데시의 사망이 예상되는 경우 체중과 일일 기초 대사량, 요요 발생 여부 대신 Danger Diet를 출력한다.
*/

// 체중 += 섭취 - 소비 g/Kcal
// 일일 에너지 소비량 = 기초 + 활동 대사량
// |섭취 - 소비| > 기초 대사 변화량 T --> 일일 기초 대사량 += ⌊ (일일 에너지 섭취량 − 일일 에너지 소비량) / 2 ⌋

// 기초대사량 고려 ㄴㄴ 로직, 고려 로직, 변화량 계산 로직

#include <iostream>
#include <algorithm>

using namespace std;

int W0, I0;
int I, A;
int T, D;

// 기초대사량 고려 X
void sumWeight1() {
    int w1 = W0;
    bool dead = false;

    for (int i=0; i<D; i++) {
        w1 += I - (I0 + A);
        if (w1 <= 0) {
            dead = true;
            break;
        }
    }

    if (dead) cout << "Danger Diet" << endl;
    else cout << w1 << " " << I0 << endl;
}

// 기초대사량 변화량 계산
int bm_change(int delta) {
    if (delta < 0 && delta % 2 != 0) {
        return (delta/2) - 1;
    }
    return delta/2;
}

// 기초대사량 고려
void sumWeight2() {
    int w2 = W0;
    int i0 = I0;
    bool dead = false;

    for (int i=0; i<D; i++) {
        int energy_diff = I - (i0 + A);

        w2 += energy_diff;
        if (w2 <= 0) {
            dead = true;
            break;
        }

        int abs_diff = (energy_diff < 0) ? -energy_diff : energy_diff;
        if (abs_diff > T) {
            i0 += bm_change(energy_diff);
        }

        if (i0 <= 0) {
            dead = true;
            break;
        }
    }

    if (dead) {
        cout << "Danger Diet" << endl;
    } else {
        cout << w2 << " " << i0 << " ";
        if (I0 - i0 > 0) cout << "YOYO" << endl;
        else cout << "NO" << endl;
    }
}


int main() {
    cin >> W0 >> I0 >> T;
    cin >> D >> I >> A;

    sumWeight1();
    sumWeight2();

    return 0;
}